read_verilog -sv -formal -overwrite {workspace}/barrel_shifter.v
design -reset-vlog; proc;
write_json {workspace}/netlist/barrel_shifter.json